app/controllers/check_links_controller.rb

  def index
    @check_links = CheckLink.all
---
SELECT "check_links".* FROM "check_links"

  def create
    @check_link = CheckLink.new()

    @check_link.get_all_links(check_link_params['checked_url'])
    respond_to do |format|
      if @check_link.save
---
INSERT INTO "check_links" ("errors_found", "checked_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["errors_found", 0], ["checked_url", "aylanetworks.com"], ["created_at", "2015-06-07 00:27:02.687340"], ["updated_at", "2015-06-07 00:27:02.687340"]]

  def destroy
    @check_link.destroy
---
DELETE FROM "check_links" WHERE "check_links"."id" = ?  [["id", 1]]

    def set_check_link
      @check_link = CheckLink.find(params[:id])
---
SELECT  "check_links".* FROM "check_links" WHERE "check_links"."id" = ? LIMIT 1  [["id", 5]]